konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/i2c.inc
#               - 1 - STOP is issued after this byte, regardless of whether or
#               not the Tx FIFO is empty. If the Tx FIFO is not empty, the
#               master immediately tries to start a new transfer by issuing a
#               START and arbitrating for the bus. - 0 - STOP is not issued
#               after this byte, regardless of whether or not the Tx FIFO is
#               empty. If the Tx FIFO is not empty, the master continues the
#               current transfer by sending/receiving data bytes according to
#               the value of the CMD bit. If the Tx FIFO is empty, the master
#               holds the SCL line low and stalls the bus until a new command
#               is available in the Tx FIFO. Reset value: 0x0
#               0x0 -> Don't Issue STOP after this command
#               0x1 -> Issue STOP after this command
.equ	I2C_IC_DATA_CMD_STOP_RESET, 0x0
.equ	I2C_IC_DATA_CMD_STOP_BITS, 0x00000200
.equ	I2C_IC_DATA_CMD_STOP_MSB, 9
.equ	I2C_IC_DATA_CMD_STOP_LSB, 9
.equ	I2C_IC_DATA_CMD_STOP_VALUE_DISABLE, 0x0
.equ	I2C_IC_DATA_CMD_STOP_VALUE_ENABLE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DATA_CMD_CMD
# Description : This bit controls whether a read or a write is performed. This
#               bit does not control the direction when the DW_apb_i2con acts
#               as a slave. It controls only the direction when it acts as a
#               master.
#
#               When a command is entered in the TX FIFO, this bit
#               distinguishes the write and read commands. In slave-receiver
#               mode, this bit is a 'don't care' because writes to this
#               register are not required. In slave-transmitter mode, a '0'
#               indicates that the data in IC_DATA_CMD is to be transmitted.
#
#               When programming this bit, you should remember the following:
#               attempting to perform a read operation after a General Call
#               command has been sent results in a TX_ABRT interrupt (bit 6 of
#               the IC_RAW_INTR_STAT register), unless bit 11 (SPECIAL) in the
#               IC_TAR register has been cleared. If a '1' is written to this
#               bit after receiving a RD_REQ interrupt, then a TX_ABRT
#               interrupt occurs.
#
#               Reset value: 0x0
#               0x0 -> Master Write Command
#               0x1 -> Master Read Command
.equ	I2C_IC_DATA_CMD_CMD_RESET, 0x0
.equ	I2C_IC_DATA_CMD_CMD_BITS, 0x00000100
.equ	I2C_IC_DATA_CMD_CMD_MSB, 8
.equ	I2C_IC_DATA_CMD_CMD_LSB, 8
.equ	I2C_IC_DATA_CMD_CMD_VALUE_WRITE, 0x0
.equ	I2C_IC_DATA_CMD_CMD_VALUE_READ, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DATA_CMD_DAT
# Description : This register contains the data to be transmitted or received
#               on the I2C bus. If you are writing to this register and want to
#               perform a read, bits 7:0 (DAT) are ignored by the DW_apb_i2c.
#               However, when you read this register, these bits return the
#               value of data received on the DW_apb_i2c interface.
#
#               Reset value: 0x0
.equ	I2C_IC_DATA_CMD_DAT_RESET, 0x00
.equ	I2C_IC_DATA_CMD_DAT_BITS, 0x000000ff
.equ	I2C_IC_DATA_CMD_DAT_MSB, 7
.equ	I2C_IC_DATA_CMD_DAT_LSB, 0
# =============================================================================
# Register    : I2C_IC_SS_SCL_HCNT
# Description : Standard Speed I2C Clock SCL High Count Register
.equ	I2C_IC_SS_SCL_HCNT_OFFSET, 0x00000014
.equ	I2C_IC_SS_SCL_HCNT_BITS, 0x0000ffff
.equ	I2C_IC_SS_SCL_HCNT_RESET, 0x00000028
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT
# Description : This register must be set before any I2C bus transaction can
#               take place to ensure proper I/O timing. This register sets the
#               SCL clock high-period count for standard speed. For more
#               information, refer to 'IC_CLK Frequency Configuration'.
#
#               This register can be written only when the I2C interface is
#               disabled which corresponds to the IC_ENABLE[0] register being
#               set to 0. Writes at other times have no effect.
#
#               The minimum valid value is 6; hardware prevents values less
#               than this being written, and if attempted results in 6 being
#               set. For designs with APB_DATA_WIDTH = 8, the order of
#               programming is important to ensure the correct operation of the
#               DW_apb_i2c. The lower byte must be programmed first. Then the
#               upper byte is programmed.
#
#               NOTE: This register must not be programmed to a value higher
#               than 65525, because DW_apb_i2c uses a 16-bit counter to flag an
#               I2C bus idle condition when this counter reaches a value of
#               IC_SS_SCL_HCNT + 10.
.equ	I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_RESET, 0x0028
.equ	I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_BITS, 0x0000ffff
.equ	I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_MSB, 15
.equ	I2C_IC_SS_SCL_HCNT_IC_SS_SCL_HCNT_LSB, 0
# =============================================================================
# Register    : I2C_IC_SS_SCL_LCNT
# Description : Standard Speed I2C Clock SCL Low Count Register
.equ	I2C_IC_SS_SCL_LCNT_OFFSET, 0x00000018
.equ	I2C_IC_SS_SCL_LCNT_BITS, 0x0000ffff
.equ	I2C_IC_SS_SCL_LCNT_RESET, 0x0000002f
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT
# Description : This register must be set before any I2C bus transaction can
#               take place to ensure proper I/O timing. This register sets the
#               SCL clock low period count for standard speed. For more
#               information, refer to 'IC_CLK Frequency Configuration'
#
#               This register can be written only when the I2C interface is
#               disabled which corresponds to the IC_ENABLE[0] register being
#               set to 0. Writes at other times have no effect.
#
#               The minimum valid value is 8; hardware prevents values less
#               than this being written, and if attempted, results in 8 being
#               set. For designs with APB_DATA_WIDTH = 8, the order of
#               programming is important to ensure the correct operation of
#               DW_apb_i2c. The lower byte must be programmed first, and then
#               the upper byte is programmed.
.equ	I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_RESET, 0x002f
.equ	I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_BITS, 0x0000ffff
.equ	I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_MSB, 15
.equ	I2C_IC_SS_SCL_LCNT_IC_SS_SCL_LCNT_LSB, 0
# =============================================================================
# Register    : I2C_IC_FS_SCL_HCNT
# Description : Fast Mode or Fast Mode Plus I2C Clock SCL High Count Register
.equ	I2C_IC_FS_SCL_HCNT_OFFSET, 0x0000001c
.equ	I2C_IC_FS_SCL_HCNT_BITS, 0x0000ffff
.equ	I2C_IC_FS_SCL_HCNT_RESET, 0x00000006
# -----------------------------------------------------------------------------
# Field       : I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT
# Description : This register must be set before any I2C bus transaction can
#               take place to ensure proper I/O timing. This register sets the
#               SCL clock high-period count for fast mode or fast mode plus. It
#               is used in high-speed mode to send the Master Code and START
#               BYTE or General CALL. For more information, refer to 'IC_CLK
#               Frequency Configuration'.
#
#               This register goes away and becomes read-only returning 0s if
#               IC_MAX_SPEED_MODE = standard. This register can be written only
#               when the I2C interface is disabled, which corresponds to the
#               IC_ENABLE[0] register being set to 0. Writes at other times
#               have no effect.
#
#               The minimum valid value is 6; hardware prevents values less
#               than this being written, and if attempted results in 6 being
#               set. For designs with APB_DATA_WIDTH == 8 the order of
#               programming is important to ensure the correct operation of the
#               DW_apb_i2c. The lower byte must be programmed first. Then the
#               upper byte is programmed.
.equ	I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_RESET, 0x0006
.equ	I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_BITS, 0x0000ffff
.equ	I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_MSB, 15
.equ	I2C_IC_FS_SCL_HCNT_IC_FS_SCL_HCNT_LSB, 0
# =============================================================================
# Register    : I2C_IC_FS_SCL_LCNT
# Description : Fast Mode or Fast Mode Plus I2C Clock SCL Low Count Register
.equ	I2C_IC_FS_SCL_LCNT_OFFSET, 0x00000020
.equ	I2C_IC_FS_SCL_LCNT_BITS, 0x0000ffff
.equ	I2C_IC_FS_SCL_LCNT_RESET, 0x0000000d
# -----------------------------------------------------------------------------
# Field       : I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT
# Description : This register must be set before any I2C bus transaction can
#               take place to ensure proper I/O timing. This register sets the
#               SCL clock low period count for fast speed. It is used in high-
#               speed mode to send the Master Code and START BYTE or General
#               CALL. For more information, refer to 'IC_CLK Frequency
#               Configuration'.
#
#               This register goes away and becomes read-only returning 0s if
#               IC_MAX_SPEED_MODE = standard.
#
#               This register can be written only when the I2C interface is
#               disabled, which corresponds to the IC_ENABLE[0] register being
#               set to 0. Writes at other times have no effect.
#
#               The minimum valid value is 8; hardware prevents values less
#               than this being written, and if attempted results in 8 being
#               set. For designs with APB_DATA_WIDTH = 8 the order of
#               programming is important to ensure the correct operation of the
#               DW_apb_i2c. The lower byte must be programmed first. Then the
#               upper byte is programmed. If the value is less than 8 then the
#               count value gets changed to 8.
.equ	I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_RESET, 0x000d
.equ	I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_BITS, 0x0000ffff
.equ	I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_MSB, 15
.equ	I2C_IC_FS_SCL_LCNT_IC_FS_SCL_LCNT_LSB, 0
# =============================================================================
# Register    : I2C_IC_INTR_STAT
# Description : I2C Interrupt Status Register
#
#               Each bit in this register has a corresponding mask bit in the
#               IC_INTR_MASK register. These bits are cleared by reading the
#               matching interrupt clear register. The unmasked raw versions of
#               these bits are available in the IC_RAW_INTR_STAT register.
.equ	I2C_IC_INTR_STAT_OFFSET, 0x0000002c
.equ	I2C_IC_INTR_STAT_BITS, 0x00001fff
.equ	I2C_IC_INTR_STAT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RESTART_DET
# Description : See IC_RAW_INTR_STAT for a detailed description of
#               R_RESTART_DET bit.
#
#               Reset value: 0x0
#               0x0 -> R_RESTART_DET interrupt is inactive
#               0x1 -> R_RESTART_DET interrupt is active
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_BITS, 0x00001000
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_MSB, 12
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_LSB, 12
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RESTART_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_GEN_CALL
# Description : See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_GEN_CALL interrupt is inactive
#               0x1 -> R_GEN_CALL interrupt is active
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_BITS, 0x00000800
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_MSB, 11
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_LSB, 11
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_GEN_CALL_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_START_DET
# Description : See IC_RAW_INTR_STAT for a detailed description of R_START_DET
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_START_DET interrupt is inactive
#               0x1 -> R_START_DET interrupt is active
.equ	I2C_IC_INTR_STAT_R_START_DET_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_START_DET_BITS, 0x00000400
.equ	I2C_IC_INTR_STAT_R_START_DET_MSB, 10
.equ	I2C_IC_INTR_STAT_R_START_DET_LSB, 10
.equ	I2C_IC_INTR_STAT_R_START_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_START_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_STOP_DET
# Description : See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_STOP_DET interrupt is inactive
#               0x1 -> R_STOP_DET interrupt is active
.equ	I2C_IC_INTR_STAT_R_STOP_DET_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_STOP_DET_BITS, 0x00000200
.equ	I2C_IC_INTR_STAT_R_STOP_DET_MSB, 9
.equ	I2C_IC_INTR_STAT_R_STOP_DET_LSB, 9
.equ	I2C_IC_INTR_STAT_R_STOP_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_STOP_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_ACTIVITY
# Description : See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_ACTIVITY interrupt is inactive
#               0x1 -> R_ACTIVITY interrupt is active
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_BITS, 0x00000100
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_MSB, 8
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_LSB, 8
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_ACTIVITY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RX_DONE
# Description : See IC_RAW_INTR_STAT for a detailed description of R_RX_DONE
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_RX_DONE interrupt is inactive
#               0x1 -> R_RX_DONE interrupt is active
.equ	I2C_IC_INTR_STAT_R_RX_DONE_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_DONE_BITS, 0x00000080
.equ	I2C_IC_INTR_STAT_R_RX_DONE_MSB, 7
.equ	I2C_IC_INTR_STAT_R_RX_DONE_LSB, 7
.equ	I2C_IC_INTR_STAT_R_RX_DONE_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_DONE_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_TX_ABRT
# Description : See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_TX_ABRT interrupt is inactive
#               0x1 -> R_TX_ABRT interrupt is active
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_BITS, 0x00000040
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_MSB, 6
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_LSB, 6
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_ABRT_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RD_REQ
# Description : See IC_RAW_INTR_STAT for a detailed description of R_RD_REQ
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_RD_REQ interrupt is inactive
#               0x1 -> R_RD_REQ interrupt is active
.equ	I2C_IC_INTR_STAT_R_RD_REQ_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RD_REQ_BITS, 0x00000020
.equ	I2C_IC_INTR_STAT_R_RD_REQ_MSB, 5
.equ	I2C_IC_INTR_STAT_R_RD_REQ_LSB, 5
.equ	I2C_IC_INTR_STAT_R_RD_REQ_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RD_REQ_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_TX_EMPTY
# Description : See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_TX_EMPTY interrupt is inactive
#               0x1 -> R_TX_EMPTY interrupt is active
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_BITS, 0x00000010
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_MSB, 4
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_LSB, 4
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_EMPTY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_TX_OVER
# Description : See IC_RAW_INTR_STAT for a detailed description of R_TX_OVER
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_TX_OVER interrupt is inactive
#               0x1 -> R_TX_OVER interrupt is active
.equ	I2C_IC_INTR_STAT_R_TX_OVER_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_OVER_BITS, 0x00000008
.equ	I2C_IC_INTR_STAT_R_TX_OVER_MSB, 3
.equ	I2C_IC_INTR_STAT_R_TX_OVER_LSB, 3
.equ	I2C_IC_INTR_STAT_R_TX_OVER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_TX_OVER_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RX_FULL
# Description : See IC_RAW_INTR_STAT for a detailed description of R_RX_FULL
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_RX_FULL interrupt is inactive
#               0x1 -> R_RX_FULL interrupt is active
.equ	I2C_IC_INTR_STAT_R_RX_FULL_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_FULL_BITS, 0x00000004
.equ	I2C_IC_INTR_STAT_R_RX_FULL_MSB, 2
.equ	I2C_IC_INTR_STAT_R_RX_FULL_LSB, 2
.equ	I2C_IC_INTR_STAT_R_RX_FULL_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_FULL_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RX_OVER
# Description : See IC_RAW_INTR_STAT for a detailed description of R_RX_OVER
#               bit.
#
#               Reset value: 0x0
#               0x0 -> R_RX_OVER interrupt is inactive
#               0x1 -> R_RX_OVER interrupt is active
.equ	I2C_IC_INTR_STAT_R_RX_OVER_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_OVER_BITS, 0x00000002
.equ	I2C_IC_INTR_STAT_R_RX_OVER_MSB, 1
.equ	I2C_IC_INTR_STAT_R_RX_OVER_LSB, 1
.equ	I2C_IC_INTR_STAT_R_RX_OVER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_OVER_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_STAT_R_RX_UNDER
# Description : See IC_RAW_INTR_STAT for a detailed description of R_RX_UNDER
#               bit.
#
#               Reset value: 0x0
#               0x0 -> RX_UNDER interrupt is inactive
#               0x1 -> RX_UNDER interrupt is active
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_RESET, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_BITS, 0x00000001
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_MSB, 0
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_LSB, 0
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_INTR_STAT_R_RX_UNDER_VALUE_ACTIVE, 0x1
# =============================================================================
# Register    : I2C_IC_INTR_MASK
# Description : I2C Interrupt Mask Register.
#
#               These bits mask their corresponding interrupt status bits. This
#               register is active low; a value of 0 masks the interrupt,
#               whereas a value of 1 unmasks the interrupt.
.equ	I2C_IC_INTR_MASK_OFFSET, 0x00000030
.equ	I2C_IC_INTR_MASK_BITS, 0x00001fff
.equ	I2C_IC_INTR_MASK_RESET, 0x000008ff
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RESTART_DET
# Description : This bit masks the R_RESTART_DET interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x0
#               0x0 -> RESTART_DET interrupt is masked
#               0x1 -> RESTART_DET interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_RESET, 0x0
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_BITS, 0x00001000
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_MSB, 12
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_LSB, 12
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RESTART_DET_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_GEN_CALL
# Description : This bit masks the R_GEN_CALL interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> GEN_CALL interrupt is masked
#               0x1 -> GEN_CALL interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_BITS, 0x00000800
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_MSB, 11
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_LSB, 11
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_GEN_CALL_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_START_DET
# Description : This bit masks the R_START_DET interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x0
#               0x0 -> START_DET interrupt is masked
#               0x1 -> START_DET interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_START_DET_RESET, 0x0
.equ	I2C_IC_INTR_MASK_M_START_DET_BITS, 0x00000400
.equ	I2C_IC_INTR_MASK_M_START_DET_MSB, 10
.equ	I2C_IC_INTR_MASK_M_START_DET_LSB, 10
.equ	I2C_IC_INTR_MASK_M_START_DET_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_START_DET_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_STOP_DET
# Description : This bit masks the R_STOP_DET interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x0
#               0x0 -> STOP_DET interrupt is masked
#               0x1 -> STOP_DET interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_STOP_DET_RESET, 0x0
.equ	I2C_IC_INTR_MASK_M_STOP_DET_BITS, 0x00000200
.equ	I2C_IC_INTR_MASK_M_STOP_DET_MSB, 9
.equ	I2C_IC_INTR_MASK_M_STOP_DET_LSB, 9
.equ	I2C_IC_INTR_MASK_M_STOP_DET_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_STOP_DET_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_ACTIVITY
# Description : This bit masks the R_ACTIVITY interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x0
#               0x0 -> ACTIVITY interrupt is masked
#               0x1 -> ACTIVITY interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_RESET, 0x0
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_BITS, 0x00000100
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_MSB, 8
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_LSB, 8
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_ACTIVITY_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RX_DONE
# Description : This bit masks the R_RX_DONE interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> RX_DONE interrupt is masked
#               0x1 -> RX_DONE interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RX_DONE_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_RX_DONE_BITS, 0x00000080
.equ	I2C_IC_INTR_MASK_M_RX_DONE_MSB, 7
.equ	I2C_IC_INTR_MASK_M_RX_DONE_LSB, 7
.equ	I2C_IC_INTR_MASK_M_RX_DONE_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RX_DONE_VALUE_DISABLED, 0x1
