konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/i2c.inc
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_TX_ABRT
# Description : This bit masks the R_TX_ABRT interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> TX_ABORT interrupt is masked
#               0x1 -> TX_ABORT interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_BITS, 0x00000040
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_MSB, 6
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_LSB, 6
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_TX_ABRT_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RD_REQ
# Description : This bit masks the R_RD_REQ interrupt in IC_INTR_STAT register.
#
#               Reset value: 0x1
#               0x0 -> RD_REQ interrupt is masked
#               0x1 -> RD_REQ interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RD_REQ_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_RD_REQ_BITS, 0x00000020
.equ	I2C_IC_INTR_MASK_M_RD_REQ_MSB, 5
.equ	I2C_IC_INTR_MASK_M_RD_REQ_LSB, 5
.equ	I2C_IC_INTR_MASK_M_RD_REQ_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RD_REQ_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_TX_EMPTY
# Description : This bit masks the R_TX_EMPTY interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> TX_EMPTY interrupt is masked
#               0x1 -> TX_EMPTY interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_BITS, 0x00000010
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_MSB, 4
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_LSB, 4
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_TX_EMPTY_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_TX_OVER
# Description : This bit masks the R_TX_OVER interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> TX_OVER interrupt is masked
#               0x1 -> TX_OVER interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_TX_OVER_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_TX_OVER_BITS, 0x00000008
.equ	I2C_IC_INTR_MASK_M_TX_OVER_MSB, 3
.equ	I2C_IC_INTR_MASK_M_TX_OVER_LSB, 3
.equ	I2C_IC_INTR_MASK_M_TX_OVER_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_TX_OVER_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RX_FULL
# Description : This bit masks the R_RX_FULL interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> RX_FULL interrupt is masked
#               0x1 -> RX_FULL interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RX_FULL_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_RX_FULL_BITS, 0x00000004
.equ	I2C_IC_INTR_MASK_M_RX_FULL_MSB, 2
.equ	I2C_IC_INTR_MASK_M_RX_FULL_LSB, 2
.equ	I2C_IC_INTR_MASK_M_RX_FULL_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RX_FULL_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RX_OVER
# Description : This bit masks the R_RX_OVER interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> RX_OVER interrupt is masked
#               0x1 -> RX_OVER interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RX_OVER_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_RX_OVER_BITS, 0x00000002
.equ	I2C_IC_INTR_MASK_M_RX_OVER_MSB, 1
.equ	I2C_IC_INTR_MASK_M_RX_OVER_LSB, 1
.equ	I2C_IC_INTR_MASK_M_RX_OVER_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RX_OVER_VALUE_DISABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_INTR_MASK_M_RX_UNDER
# Description : This bit masks the R_RX_UNDER interrupt in IC_INTR_STAT
#               register.
#
#               Reset value: 0x1
#               0x0 -> RX_UNDER interrupt is masked
#               0x1 -> RX_UNDER interrupt is unmasked
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_RESET, 0x1
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_BITS, 0x00000001
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_MSB, 0
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_LSB, 0
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_VALUE_ENABLED, 0x0
.equ	I2C_IC_INTR_MASK_M_RX_UNDER_VALUE_DISABLED, 0x1
# =============================================================================
# Register    : I2C_IC_RAW_INTR_STAT
# Description : I2C Raw Interrupt Status Register
#
#               Unlike the IC_INTR_STAT register, these bits are not masked so
#               they always show the true status of the DW_apb_i2c.
.equ	I2C_IC_RAW_INTR_STAT_OFFSET, 0x00000034
.equ	I2C_IC_RAW_INTR_STAT_BITS, 0x00001fff
.equ	I2C_IC_RAW_INTR_STAT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RESTART_DET
# Description : Indicates whether a RESTART condition has occurred on the I2C
#               interface when DW_apb_i2c is operating in Slave mode and the
#               slave is being addressed. Enabled only when
#               IC_SLV_RESTART_DET_EN=1.
#
#               Note: However, in high-speed mode or during a START BYTE
#               transfer, the RESTART comes before the address field as per the
#               I2C protocol. In this case, the slave is not the addressed
#               slave when the RESTART is issued, therefore DW_apb_i2c does not
#               generate the RESTART_DET interrupt.
#
#               Reset value: 0x0
#               0x0 -> RESTART_DET interrupt is inactive
#               0x1 -> RESTART_DET interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_BITS, 0x00001000
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_MSB, 12
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_LSB, 12
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RESTART_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_GEN_CALL
# Description : Set only when a General Call address is received and it is
#               acknowledged. It stays set until it is cleared either by
#               disabling DW_apb_i2c or when the CPU reads bit 0 of the
#               IC_CLR_GEN_CALL register. DW_apb_i2c stores the received data
#               in the Rx buffer.
#
#               Reset value: 0x0
#               0x0 -> GEN_CALL interrupt is inactive
#               0x1 -> GEN_CALL interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_BITS, 0x00000800
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_MSB, 11
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_LSB, 11
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_GEN_CALL_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_START_DET
# Description : Indicates whether a START or RESTART condition has occurred on
#               the I2C interface regardless of whether DW_apb_i2c is operating
#               in slave or master mode.
#
#               Reset value: 0x0
#               0x0 -> START_DET interrupt is inactive
#               0x1 -> START_DET interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_START_DET_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_START_DET_BITS, 0x00000400
.equ	I2C_IC_RAW_INTR_STAT_START_DET_MSB, 10
.equ	I2C_IC_RAW_INTR_STAT_START_DET_LSB, 10
.equ	I2C_IC_RAW_INTR_STAT_START_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_START_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_STOP_DET
# Description : Indicates whether a STOP condition has occurred on the I2C
#               interface regardless of whether DW_apb_i2c is operating in
#               slave or master mode.
#
#               In Slave Mode: - If IC_CON[7]=1'b1  (STOP_DET_IFADDRESSED), the
#               STOP_DET interrupt will be issued only if slave is addressed.
#               Note: During a general call address, this slave does not issue
#               a STOP_DET interrupt if STOP_DET_IF_ADDRESSED=1'b1, even if the
#               slave responds to the general call address by generating ACK.
#               The STOP_DET interrupt is generated only when the transmitted
#               address matches the slave address (SAR). - If IC_CON[7]=1'b0
#               (STOP_DET_IFADDRESSED), the STOP_DET interrupt is issued
#               irrespective of whether it is being addressed. In Master Mode:
#               - If IC_CON[10]=1'b1  (STOP_DET_IF_MASTER_ACTIVE),the STOP_DET
#               interrupt will be issued only if Master is active. - If
#               IC_CON[10]=1'b0  (STOP_DET_IFADDRESSED),the STOP_DET interrupt
#               will be issued irrespective of whether master is active or not.
#               Reset value: 0x0
#               0x0 -> STOP_DET interrupt is inactive
#               0x1 -> STOP_DET interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_BITS, 0x00000200
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_MSB, 9
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_LSB, 9
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_STOP_DET_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_ACTIVITY
# Description : This bit captures DW_apb_i2c activity and stays set until it is
#               cleared. There are four ways to clear it: - Disabling the
#               DW_apb_i2c - Reading the IC_CLR_ACTIVITY register - Reading the
#               IC_CLR_INTR register - System reset Once this bit is set, it
#               stays set unless one of the four methods is used to clear it.
#               Even if the DW_apb_i2c module is idle, this bit remains set
#               until cleared, indicating that there was activity on the bus.
#
#               Reset value: 0x0
#               0x0 -> RAW_INTR_ACTIVITY interrupt is inactive
#               0x1 -> RAW_INTR_ACTIVITY interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_BITS, 0x00000100
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_MSB, 8
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_LSB, 8
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_ACTIVITY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RX_DONE
# Description : When the DW_apb_i2c is acting as a slave-transmitter, this bit
#               is set to 1 if the master does not acknowledge a transmitted
#               byte. This occurs on the last byte of the transmission,
#               indicating that the transmission is done.
#
#               Reset value: 0x0
#               0x0 -> RX_DONE interrupt is inactive
#               0x1 -> RX_DONE interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_BITS, 0x00000080
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_MSB, 7
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_LSB, 7
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_DONE_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_TX_ABRT
# Description : This bit indicates if DW_apb_i2c, as an I2C transmitter, is
#               unable to complete the intended actions on the contents of the
#               transmit FIFO. This situation can occur both as an I2C master
#               or an I2C slave, and is referred to as a 'transmit abort'. When
#               this bit is set to 1, the IC_TX_ABRT_SOURCE register indicates
#               the reason why the transmit abort takes places.
#
#               Note:  The DW_apb_i2c flushes/resets/empties the TX_FIFO and
#               RX_FIFO whenever there is a transmit abort caused by any of the
#               events tracked by the IC_TX_ABRT_SOURCE register. The FIFOs
#               remains in this flushed state until the register IC_CLR_TX_ABRT
#               is read. Once this read is performed, the Tx FIFO is then ready
#               to accept more data bytes from the APB interface.
#
#               Reset value: 0x0
#               0x0 -> TX_ABRT interrupt is inactive
#               0x1 -> TX_ABRT interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_BITS, 0x00000040
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_MSB, 6
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_LSB, 6
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_ABRT_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RD_REQ
# Description : This bit is set to 1 when DW_apb_i2c is acting as a slave and
#               another I2C master is attempting to read data from DW_apb_i2c.
#               The DW_apb_i2c holds the I2C bus in a wait state (SCL=0) until
#               this interrupt is serviced, which means that the slave has been
#               addressed by a remote master that is asking for data to be
#               transferred. The processor must respond to this interrupt and
#               then write the requested data to the IC_DATA_CMD register. This
#               bit is set to 0 just after the processor reads the
#               IC_CLR_RD_REQ register.
#
#               Reset value: 0x0
#               0x0 -> RD_REQ interrupt is inactive
#               0x1 -> RD_REQ interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_BITS, 0x00000020
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_MSB, 5
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_LSB, 5
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RD_REQ_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_TX_EMPTY
# Description : The behavior of the TX_EMPTY interrupt status differs based on
#               the TX_EMPTY_CTRL selection in the IC_CON register. - When
#               TX_EMPTY_CTRL = 0: This bit is set to 1 when the transmit
#               buffer is at or below the threshold value set in the IC_TX_TL
#               register. - When TX_EMPTY_CTRL = 1: This bit is set to 1 when
#               the transmit buffer is at or below the threshold value set in
#               the IC_TX_TL register and the transmission of the address/data
#               from the internal shift register for the most recently popped
#               command is completed. It is automatically cleared by hardware
#               when the buffer level goes above the threshold. When
#               IC_ENABLE[0] is set to 0, the TX FIFO is flushed and held in
#               reset. There the TX FIFO looks like it has no data within it,
#               so this bit is set to 1, provided there is activity in the
#               master or slave state machines. When there is no longer any
#               activity, then with ic_en=0, this bit is set to 0.
#
#               Reset value: 0x0.
#               0x0 -> TX_EMPTY interrupt is inactive
#               0x1 -> TX_EMPTY interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_BITS, 0x00000010
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_MSB, 4
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_LSB, 4
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_EMPTY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_TX_OVER
# Description : Set during transmit if the transmit buffer is filled to
#               IC_TX_BUFFER_DEPTH and the processor attempts to issue another
#               I2C command by writing to the IC_DATA_CMD register. When the
#               module is disabled, this bit keeps its level until the master
#               or slave state machines go into idle, and when ic_en goes to 0,
#               this interrupt is cleared.
#
#               Reset value: 0x0
#               0x0 -> TX_OVER interrupt is inactive
#               0x1 -> TX_OVER interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_BITS, 0x00000008
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_MSB, 3
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_LSB, 3
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_TX_OVER_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RX_FULL
# Description : Set when the receive buffer reaches or goes above the RX_TL
#               threshold in the IC_RX_TL register. It is automatically cleared
#               by hardware when buffer level goes below the threshold. If the
#               module is disabled (IC_ENABLE[0]=0), the RX FIFO is flushed and
#               held in reset; therefore the RX FIFO is not full. So this bit
#               is cleared once the IC_ENABLE bit 0 is programmed with a 0,
#               regardless of the activity that continues.
#
#               Reset value: 0x0
#               0x0 -> RX_FULL interrupt is inactive
#               0x1 -> RX_FULL interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_BITS, 0x00000004
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_MSB, 2
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_LSB, 2
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_FULL_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RX_OVER
# Description : Set if the receive buffer is completely filled to
#               IC_RX_BUFFER_DEPTH and an additional byte is received from an
#               external I2C device. The DW_apb_i2c acknowledges this, but any
#               data bytes received after the FIFO is full are lost. If the
#               module is disabled (IC_ENABLE[0]=0), this bit keeps its level
#               until the master or slave state machines go into idle, and when
#               ic_en goes to 0, this interrupt is cleared.
#
#               Note:  If bit 9 of the IC_CON register (RX_FIFO_FULL_HLD_CTRL)
#               is programmed to HIGH, then the RX_OVER interrupt never occurs,
#               because the Rx FIFO never overflows.
#
#               Reset value: 0x0
#               0x0 -> RX_OVER interrupt is inactive
#               0x1 -> RX_OVER interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_BITS, 0x00000002
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_MSB, 1
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_LSB, 1
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_OVER_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RAW_INTR_STAT_RX_UNDER
# Description : Set if the processor attempts to read the receive buffer when
#               it is empty by reading from the IC_DATA_CMD register. If the
#               module is disabled (IC_ENABLE[0]=0), this bit keeps its level
#               until the master or slave state machines go into idle, and when
#               ic_en goes to 0, this interrupt is cleared.
#
#               Reset value: 0x0
#               0x0 -> RX_UNDER interrupt is inactive
#               0x1 -> RX_UNDER interrupt is active
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_RESET, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_BITS, 0x00000001
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_MSB, 0
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_LSB, 0
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_VALUE_INACTIVE, 0x0
.equ	I2C_IC_RAW_INTR_STAT_RX_UNDER_VALUE_ACTIVE, 0x1
# =============================================================================
# Register    : I2C_IC_RX_TL
# Description : I2C Receive FIFO Threshold Register
.equ	I2C_IC_RX_TL_OFFSET, 0x00000038
.equ	I2C_IC_RX_TL_BITS, 0x000000ff
.equ	I2C_IC_RX_TL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RX_TL_RX_TL
# Description : Receive FIFO Threshold Level.
#
#               Controls the level of entries (or above) that triggers the
#               RX_FULL interrupt (bit 2 in IC_RAW_INTR_STAT register). The
#               valid range is 0-255, with the additional restriction that
#               hardware does not allow this value to be set to a value larger
#               than the depth of the buffer. If an attempt is made to do that,
#               the actual value set will be the maximum depth of the buffer. A
#               value of 0 sets the threshold for 1 entry, and a value of 255
#               sets the threshold for 256 entries.
.equ	I2C_IC_RX_TL_RX_TL_RESET, 0x00
.equ	I2C_IC_RX_TL_RX_TL_BITS, 0x000000ff
.equ	I2C_IC_RX_TL_RX_TL_MSB, 7
.equ	I2C_IC_RX_TL_RX_TL_LSB, 0
# =============================================================================
# Register    : I2C_IC_TX_TL
# Description : I2C Transmit FIFO Threshold Register
.equ	I2C_IC_TX_TL_OFFSET, 0x0000003c
.equ	I2C_IC_TX_TL_BITS, 0x000000ff
.equ	I2C_IC_TX_TL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_TL_TX_TL
# Description : Transmit FIFO Threshold Level.
#
#               Controls the level of entries (or below) that trigger the
#               TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register). The
#               valid range is 0-255, with the additional restriction that it
#               may not be set to value larger than the depth of the buffer. If
#               an attempt is made to do that, the actual value set will be the
#               maximum depth of the buffer. A value of 0 sets the threshold
#               for 0 entries, and a value of 255 sets the threshold for 255
#               entries.
.equ	I2C_IC_TX_TL_TX_TL_RESET, 0x00
.equ	I2C_IC_TX_TL_TX_TL_BITS, 0x000000ff
.equ	I2C_IC_TX_TL_TX_TL_MSB, 7
.equ	I2C_IC_TX_TL_TX_TL_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_INTR
# Description : Clear Combined and Individual Interrupt Register
.equ	I2C_IC_CLR_INTR_OFFSET, 0x00000040
.equ	I2C_IC_CLR_INTR_BITS, 0x00000001
.equ	I2C_IC_CLR_INTR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_INTR_CLR_INTR
# Description : Read this register to clear the combined interrupt, all
#               individual interrupts, and the IC_TX_ABRT_SOURCE register. This
#               bit does not clear hardware clearable interrupts but software
#               clearable interrupts. Refer to Bit 9 of the IC_TX_ABRT_SOURCE
#               register for an exception to clearing IC_TX_ABRT_SOURCE.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_INTR_CLR_INTR_RESET, 0x0
.equ	I2C_IC_CLR_INTR_CLR_INTR_BITS, 0x00000001
.equ	I2C_IC_CLR_INTR_CLR_INTR_MSB, 0
.equ	I2C_IC_CLR_INTR_CLR_INTR_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_RX_UNDER
# Description : Clear RX_UNDER Interrupt Register
.equ	I2C_IC_CLR_RX_UNDER_OFFSET, 0x00000044
.equ	I2C_IC_CLR_RX_UNDER_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_UNDER_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER
# Description : Read this register to clear the RX_UNDER interrupt (bit 0) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_RESET, 0x0
