konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/i2c.inc
.equ	I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_MSB, 0
.equ	I2C_IC_CLR_RX_UNDER_CLR_RX_UNDER_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_RX_OVER
# Description : Clear RX_OVER Interrupt Register
.equ	I2C_IC_CLR_RX_OVER_OFFSET, 0x00000048
.equ	I2C_IC_CLR_RX_OVER_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_OVER_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_RX_OVER_CLR_RX_OVER
# Description : Read this register to clear the RX_OVER interrupt (bit 1) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_RX_OVER_CLR_RX_OVER_RESET, 0x0
.equ	I2C_IC_CLR_RX_OVER_CLR_RX_OVER_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_OVER_CLR_RX_OVER_MSB, 0
.equ	I2C_IC_CLR_RX_OVER_CLR_RX_OVER_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_TX_OVER
# Description : Clear TX_OVER Interrupt Register
.equ	I2C_IC_CLR_TX_OVER_OFFSET, 0x0000004c
.equ	I2C_IC_CLR_TX_OVER_BITS, 0x00000001
.equ	I2C_IC_CLR_TX_OVER_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_TX_OVER_CLR_TX_OVER
# Description : Read this register to clear the TX_OVER interrupt (bit 3) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_TX_OVER_CLR_TX_OVER_RESET, 0x0
.equ	I2C_IC_CLR_TX_OVER_CLR_TX_OVER_BITS, 0x00000001
.equ	I2C_IC_CLR_TX_OVER_CLR_TX_OVER_MSB, 0
.equ	I2C_IC_CLR_TX_OVER_CLR_TX_OVER_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_RD_REQ
# Description : Clear RD_REQ Interrupt Register
.equ	I2C_IC_CLR_RD_REQ_OFFSET, 0x00000050
.equ	I2C_IC_CLR_RD_REQ_BITS, 0x00000001
.equ	I2C_IC_CLR_RD_REQ_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_RD_REQ_CLR_RD_REQ
# Description : Read this register to clear the RD_REQ interrupt (bit 5) of the
#               IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_RD_REQ_CLR_RD_REQ_RESET, 0x0
.equ	I2C_IC_CLR_RD_REQ_CLR_RD_REQ_BITS, 0x00000001
.equ	I2C_IC_CLR_RD_REQ_CLR_RD_REQ_MSB, 0
.equ	I2C_IC_CLR_RD_REQ_CLR_RD_REQ_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_TX_ABRT
# Description : Clear TX_ABRT Interrupt Register
.equ	I2C_IC_CLR_TX_ABRT_OFFSET, 0x00000054
.equ	I2C_IC_CLR_TX_ABRT_BITS, 0x00000001
.equ	I2C_IC_CLR_TX_ABRT_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT
# Description : Read this register to clear the TX_ABRT interrupt (bit 6) of
#               the IC_RAW_INTR_STAT register, and the IC_TX_ABRT_SOURCE
#               register. This also releases the TX FIFO from the flushed/reset
#               state, allowing more writes to the TX FIFO. Refer to Bit 9 of
#               the IC_TX_ABRT_SOURCE register for an exception to clearing
#               IC_TX_ABRT_SOURCE.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_RESET, 0x0
.equ	I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_BITS, 0x00000001
.equ	I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_MSB, 0
.equ	I2C_IC_CLR_TX_ABRT_CLR_TX_ABRT_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_RX_DONE
# Description : Clear RX_DONE Interrupt Register
.equ	I2C_IC_CLR_RX_DONE_OFFSET, 0x00000058
.equ	I2C_IC_CLR_RX_DONE_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_DONE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_RX_DONE_CLR_RX_DONE
# Description : Read this register to clear the RX_DONE interrupt (bit 7) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_RX_DONE_CLR_RX_DONE_RESET, 0x0
.equ	I2C_IC_CLR_RX_DONE_CLR_RX_DONE_BITS, 0x00000001
.equ	I2C_IC_CLR_RX_DONE_CLR_RX_DONE_MSB, 0
.equ	I2C_IC_CLR_RX_DONE_CLR_RX_DONE_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_ACTIVITY
# Description : Clear ACTIVITY Interrupt Register
.equ	I2C_IC_CLR_ACTIVITY_OFFSET, 0x0000005c
.equ	I2C_IC_CLR_ACTIVITY_BITS, 0x00000001
.equ	I2C_IC_CLR_ACTIVITY_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY
# Description : Reading this register clears the ACTIVITY interrupt if the I2C
#               is not active anymore. If the I2C module is still active on the
#               bus, the ACTIVITY interrupt bit continues to be set. It is
#               automatically cleared by hardware if the module is disabled and
#               if there is no further activity on the bus. The value read from
#               this register to get status of the ACTIVITY interrupt (bit 8)
#               of the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_RESET, 0x0
.equ	I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_BITS, 0x00000001
.equ	I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_MSB, 0
.equ	I2C_IC_CLR_ACTIVITY_CLR_ACTIVITY_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_STOP_DET
# Description : Clear STOP_DET Interrupt Register
.equ	I2C_IC_CLR_STOP_DET_OFFSET, 0x00000060
.equ	I2C_IC_CLR_STOP_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_STOP_DET_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_STOP_DET_CLR_STOP_DET
# Description : Read this register to clear the STOP_DET interrupt (bit 9) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_STOP_DET_CLR_STOP_DET_RESET, 0x0
.equ	I2C_IC_CLR_STOP_DET_CLR_STOP_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_STOP_DET_CLR_STOP_DET_MSB, 0
.equ	I2C_IC_CLR_STOP_DET_CLR_STOP_DET_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_START_DET
# Description : Clear START_DET Interrupt Register
.equ	I2C_IC_CLR_START_DET_OFFSET, 0x00000064
.equ	I2C_IC_CLR_START_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_START_DET_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_START_DET_CLR_START_DET
# Description : Read this register to clear the START_DET interrupt (bit 10) of
#               the IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_START_DET_CLR_START_DET_RESET, 0x0
.equ	I2C_IC_CLR_START_DET_CLR_START_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_START_DET_CLR_START_DET_MSB, 0
.equ	I2C_IC_CLR_START_DET_CLR_START_DET_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_GEN_CALL
# Description : Clear GEN_CALL Interrupt Register
.equ	I2C_IC_CLR_GEN_CALL_OFFSET, 0x00000068
.equ	I2C_IC_CLR_GEN_CALL_BITS, 0x00000001
.equ	I2C_IC_CLR_GEN_CALL_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL
# Description : Read this register to clear the GEN_CALL interrupt (bit 11) of
#               IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_RESET, 0x0
.equ	I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_BITS, 0x00000001
.equ	I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_MSB, 0
.equ	I2C_IC_CLR_GEN_CALL_CLR_GEN_CALL_LSB, 0
# =============================================================================
# Register    : I2C_IC_ENABLE
# Description : I2C Enable Register
.equ	I2C_IC_ENABLE_OFFSET, 0x0000006c
.equ	I2C_IC_ENABLE_BITS, 0x00000007
.equ	I2C_IC_ENABLE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_TX_CMD_BLOCK
# Description : In Master mode: - 1'b1: Blocks the transmission of data on I2C
#               bus even if Tx FIFO has data to transmit. - 1'b0: The
#               transmission of data starts on I2C bus automatically, as soon
#               as the first data is available in the Tx FIFO. Note: To block
#               the execution of Master commands, set the TX_CMD_BLOCK bit only
#               when Tx FIFO is empty (IC_STATUS[2]==1) and Master is in Idle
#               state (IC_STATUS[5] == 0). Any further commands put in the Tx
#               FIFO are not executed until TX_CMD_BLOCK bit is unset. Reset
#               value:  IC_TX_CMD_BLOCK_DEFAULT
#               0x0 -> Tx Command execution not blocked
#               0x1 -> Tx Command execution blocked
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_RESET, 0x0
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_BITS, 0x00000004
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_MSB, 2
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_LSB, 2
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_VALUE_NOT_BLOCKED, 0x0
.equ	I2C_IC_ENABLE_TX_CMD_BLOCK_VALUE_BLOCKED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_ABORT
# Description : When set, the controller initiates the transfer abort. - 0:
#               ABORT not initiated or ABORT done - 1: ABORT operation in
#               progress The software can abort the I2C transfer in master mode
#               by setting this bit. The software can set this bit only when
#               ENABLE is already set; otherwise, the controller ignores any
#               write to ABORT bit. The software cannot clear the ABORT bit
#               once set. In response to an ABORT, the controller issues a STOP
#               and flushes the Tx FIFO after completing the current transfer,
#               then sets the TX_ABORT interrupt after the abort operation. The
#               ABORT bit is cleared automatically after the abort operation.
#
#               For a detailed description on how to abort I2C transfers, refer
#               to 'Aborting I2C Transfers'.
#
#               Reset value: 0x0
#               0x0 -> ABORT operation not in progress
#               0x1 -> ABORT operation in progress
.equ	I2C_IC_ENABLE_ABORT_RESET, 0x0
.equ	I2C_IC_ENABLE_ABORT_BITS, 0x00000002
.equ	I2C_IC_ENABLE_ABORT_MSB, 1
.equ	I2C_IC_ENABLE_ABORT_LSB, 1
.equ	I2C_IC_ENABLE_ABORT_VALUE_DISABLE, 0x0
.equ	I2C_IC_ENABLE_ABORT_VALUE_ENABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_ENABLE
# Description : Controls whether the DW_apb_i2c is enabled. - 0: Disables
#               DW_apb_i2c (TX and RX FIFOs are held in an erased state) - 1:
#               Enables DW_apb_i2c Software can disable DW_apb_i2c while it is
#               active. However, it is important that care be taken to ensure
#               that DW_apb_i2c is disabled properly. A recommended procedure
#               is described in 'Disabling DW_apb_i2c'.
#
#               When DW_apb_i2c is disabled, the following occurs: - The TX
#               FIFO and RX FIFO get flushed. - Status bits in the IC_INTR_STAT
#               register are still active until DW_apb_i2c goes into IDLE
#               state. If the module is transmitting, it stops as well as
#               deletes the contents of the transmit buffer after the current
#               transfer is complete. If the module is receiving, the
#               DW_apb_i2c stops the current transfer at the end of the current
#               byte and does not acknowledge the transfer.
#
#               In systems with asynchronous pclk and ic_clk when IC_CLK_TYPE
#               parameter set to asynchronous (1), there is a two ic_clk delay
#               when enabling or disabling the DW_apb_i2c. For a detailed
#               description on how to disable DW_apb_i2c, refer to 'Disabling
#               DW_apb_i2c'
#
#               Reset value: 0x0
#               0x0 -> I2C is disabled
#               0x1 -> I2C is enabled
.equ	I2C_IC_ENABLE_ENABLE_RESET, 0x0
.equ	I2C_IC_ENABLE_ENABLE_BITS, 0x00000001
.equ	I2C_IC_ENABLE_ENABLE_MSB, 0
.equ	I2C_IC_ENABLE_ENABLE_LSB, 0
.equ	I2C_IC_ENABLE_ENABLE_VALUE_DISABLED, 0x0
.equ	I2C_IC_ENABLE_ENABLE_VALUE_ENABLED, 0x1
# =============================================================================
# Register    : I2C_IC_STATUS
# Description : I2C Status Register
#
#               This is a read-only register used to indicate the current
#               transfer status and FIFO status. The status register may be
#               read at any time. None of the bits in this register request an
#               interrupt.
#
#               When the I2C is disabled by writing 0 in bit 0 of the IC_ENABLE
#               register: - Bits 1 and 2 are set to 1 - Bits 3 and 10 are set
#               to 0 When the master or slave state machines goes to idle and
#               ic_en=0: - Bits 5 and 6 are set to 0
.equ	I2C_IC_STATUS_OFFSET, 0x00000070
.equ	I2C_IC_STATUS_BITS, 0x0000007f
.equ	I2C_IC_STATUS_RESET, 0x00000006
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_SLV_ACTIVITY
# Description : Slave FSM Activity Status. When the Slave Finite State Machine
#               (FSM) is not in the IDLE state, this bit is set. - 0: Slave FSM
#               is in IDLE state so the Slave part of DW_apb_i2c is not Active
#               - 1: Slave FSM is not in IDLE state so the Slave part of
#               DW_apb_i2c is Active Reset value: 0x0
#               0x0 -> Slave is idle
#               0x1 -> Slave not idle
.equ	I2C_IC_STATUS_SLV_ACTIVITY_RESET, 0x0
.equ	I2C_IC_STATUS_SLV_ACTIVITY_BITS, 0x00000040
.equ	I2C_IC_STATUS_SLV_ACTIVITY_MSB, 6
.equ	I2C_IC_STATUS_SLV_ACTIVITY_LSB, 6
.equ	I2C_IC_STATUS_SLV_ACTIVITY_VALUE_IDLE, 0x0
.equ	I2C_IC_STATUS_SLV_ACTIVITY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_MST_ACTIVITY
# Description : Master FSM Activity Status. When the Master Finite State
#               Machine (FSM) is not in the IDLE state, this bit is set. - 0:
#               Master FSM is in IDLE state so the Master part of DW_apb_i2c is
#               not Active - 1: Master FSM is not in IDLE state so the Master
#               part of DW_apb_i2c is Active Note: IC_STATUS[0]-that is,
#               ACTIVITY bit-is the OR of SLV_ACTIVITY and MST_ACTIVITY bits.
#
#               Reset value: 0x0
#               0x0 -> Master is idle
#               0x1 -> Master not idle
.equ	I2C_IC_STATUS_MST_ACTIVITY_RESET, 0x0
.equ	I2C_IC_STATUS_MST_ACTIVITY_BITS, 0x00000020
.equ	I2C_IC_STATUS_MST_ACTIVITY_MSB, 5
.equ	I2C_IC_STATUS_MST_ACTIVITY_LSB, 5
.equ	I2C_IC_STATUS_MST_ACTIVITY_VALUE_IDLE, 0x0
.equ	I2C_IC_STATUS_MST_ACTIVITY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_RFF
# Description : Receive FIFO Completely Full. When the receive FIFO is
#               completely full, this bit is set. When the receive FIFO
#               contains one or more empty location, this bit is cleared. - 0:
#               Receive FIFO is not full - 1: Receive FIFO is full Reset value:
#               0x0
#               0x0 -> Rx FIFO not full
#               0x1 -> Rx FIFO is full
.equ	I2C_IC_STATUS_RFF_RESET, 0x0
.equ	I2C_IC_STATUS_RFF_BITS, 0x00000010
.equ	I2C_IC_STATUS_RFF_MSB, 4
.equ	I2C_IC_STATUS_RFF_LSB, 4
.equ	I2C_IC_STATUS_RFF_VALUE_NOT_FULL, 0x0
.equ	I2C_IC_STATUS_RFF_VALUE_FULL, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_RFNE
# Description : Receive FIFO Not Empty. This bit is set when the receive FIFO
#               contains one or more entries; it is cleared when the receive
#               FIFO is empty. - 0: Receive FIFO is empty - 1: Receive FIFO is
#               not empty Reset value: 0x0
#               0x0 -> Rx FIFO is empty
#               0x1 -> Rx FIFO not empty
.equ	I2C_IC_STATUS_RFNE_RESET, 0x0
.equ	I2C_IC_STATUS_RFNE_BITS, 0x00000008
.equ	I2C_IC_STATUS_RFNE_MSB, 3
.equ	I2C_IC_STATUS_RFNE_LSB, 3
.equ	I2C_IC_STATUS_RFNE_VALUE_EMPTY, 0x0
.equ	I2C_IC_STATUS_RFNE_VALUE_NOT_EMPTY, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_TFE
# Description : Transmit FIFO Completely Empty. When the transmit FIFO is
#               completely empty, this bit is set. When it contains one or more
#               valid entries, this bit is cleared. This bit field does not
#               request an interrupt. - 0: Transmit FIFO is not empty - 1:
#               Transmit FIFO is empty Reset value: 0x1
#               0x0 -> Tx FIFO not empty
#               0x1 -> Tx FIFO is empty
.equ	I2C_IC_STATUS_TFE_RESET, 0x1
.equ	I2C_IC_STATUS_TFE_BITS, 0x00000004
.equ	I2C_IC_STATUS_TFE_MSB, 2
.equ	I2C_IC_STATUS_TFE_LSB, 2
.equ	I2C_IC_STATUS_TFE_VALUE_NON_EMPTY, 0x0
.equ	I2C_IC_STATUS_TFE_VALUE_EMPTY, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_TFNF
# Description : Transmit FIFO Not Full. Set when the transmit FIFO contains one
#               or more empty locations, and is cleared when the FIFO is full.
#               - 0: Transmit FIFO is full - 1: Transmit FIFO is not full Reset
#               value: 0x1
#               0x0 -> Tx FIFO is full
#               0x1 -> Tx FIFO not full
.equ	I2C_IC_STATUS_TFNF_RESET, 0x1
.equ	I2C_IC_STATUS_TFNF_BITS, 0x00000002
.equ	I2C_IC_STATUS_TFNF_MSB, 1
.equ	I2C_IC_STATUS_TFNF_LSB, 1
.equ	I2C_IC_STATUS_TFNF_VALUE_FULL, 0x0
.equ	I2C_IC_STATUS_TFNF_VALUE_NOT_FULL, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_STATUS_ACTIVITY
# Description : I2C Activity Status. Reset value: 0x0
#               0x0 -> I2C is idle
#               0x1 -> I2C is active
.equ	I2C_IC_STATUS_ACTIVITY_RESET, 0x0
.equ	I2C_IC_STATUS_ACTIVITY_BITS, 0x00000001
.equ	I2C_IC_STATUS_ACTIVITY_MSB, 0
.equ	I2C_IC_STATUS_ACTIVITY_LSB, 0
.equ	I2C_IC_STATUS_ACTIVITY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_STATUS_ACTIVITY_VALUE_ACTIVE, 0x1
# =============================================================================
# Register    : I2C_IC_TXFLR
# Description : I2C Transmit FIFO Level Register This register contains the
#               number of valid data entries in the transmit FIFO buffer. It is
#               cleared whenever: - The I2C is disabled - There is a transmit
#               abort - that is, TX_ABRT bit is set in the IC_RAW_INTR_STAT
#               register - The slave bulk transmit mode is aborted The register
#               increments whenever data is placed into the transmit FIFO and
#               decrements when data is taken from the transmit FIFO.
.equ	I2C_IC_TXFLR_OFFSET, 0x00000074
.equ	I2C_IC_TXFLR_BITS, 0x0000001f
.equ	I2C_IC_TXFLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TXFLR_TXFLR
# Description : Transmit FIFO Level. Contains the number of valid data entries
#               in the transmit FIFO.
#
#               Reset value: 0x0
.equ	I2C_IC_TXFLR_TXFLR_RESET, 0x00
.equ	I2C_IC_TXFLR_TXFLR_BITS, 0x0000001f
.equ	I2C_IC_TXFLR_TXFLR_MSB, 4
.equ	I2C_IC_TXFLR_TXFLR_LSB, 0
# =============================================================================
# Register    : I2C_IC_RXFLR
# Description : I2C Receive FIFO Level Register This register contains the
#               number of valid data entries in the receive FIFO buffer. It is
#               cleared whenever: - The I2C is disabled - Whenever there is a
#               transmit abort caused by any of the events tracked in
#               IC_TX_ABRT_SOURCE The register increments whenever data is
#               placed into the receive FIFO and decrements when data is taken
#               from the receive FIFO.
.equ	I2C_IC_RXFLR_OFFSET, 0x00000078
.equ	I2C_IC_RXFLR_BITS, 0x0000001f
.equ	I2C_IC_RXFLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_RXFLR_RXFLR
# Description : Receive FIFO Level. Contains the number of valid data entries
#               in the receive FIFO.
#
#               Reset value: 0x0
.equ	I2C_IC_RXFLR_RXFLR_RESET, 0x00
.equ	I2C_IC_RXFLR_RXFLR_BITS, 0x0000001f
.equ	I2C_IC_RXFLR_RXFLR_MSB, 4
.equ	I2C_IC_RXFLR_RXFLR_LSB, 0
# =============================================================================
# Register    : I2C_IC_SDA_HOLD
# Description : I2C SDA Hold Time Length Register
#
#               The bits [15:0] of this register are used to control the hold
#               time of SDA during transmit in both slave and master mode
#               (after SCL goes from HIGH to LOW).
#
#               The bits [23:16] of this register are used to extend the SDA
#               transition (if any) whenever SCL is HIGH in the receiver in
#               either master or slave mode.
#
#               Writes to this register succeed only when IC_ENABLE[0]=0.
#
#               The values in this register are in units of ic_clk period. The
#               value programmed in IC_SDA_TX_HOLD must be greater than the
#               minimum hold time in each mode (one cycle in master mode, seven
#               cycles in slave mode) for the value to be implemented.
#
#               The programmed SDA hold time during transmit (IC_SDA_TX_HOLD)
#               cannot exceed at any time the duration of the low part of scl.
#               Therefore the programmed value cannot be larger than
#               N_SCL_LOW-2, where N_SCL_LOW is the duration of the low part of
#               the scl period measured in ic_clk cycles.
.equ	I2C_IC_SDA_HOLD_OFFSET, 0x0000007c
.equ	I2C_IC_SDA_HOLD_BITS, 0x00ffffff
.equ	I2C_IC_SDA_HOLD_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD
# Description : Sets the required SDA hold time in units of ic_clk period, when
#               DW_apb_i2c acts as a receiver.
#
#               Reset value: IC_DEFAULT_SDA_HOLD[23:16].
.equ	I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_RESET, 0x00
.equ	I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_BITS, 0x00ff0000
.equ	I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_MSB, 23
.equ	I2C_IC_SDA_HOLD_IC_SDA_RX_HOLD_LSB, 16
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD
# Description : Sets the required SDA hold time in units of ic_clk period, when
#               DW_apb_i2c acts as a transmitter.
#
#               Reset value: IC_DEFAULT_SDA_HOLD[15:0].
.equ	I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_RESET, 0x0001
.equ	I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_BITS, 0x0000ffff
.equ	I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_MSB, 15
.equ	I2C_IC_SDA_HOLD_IC_SDA_TX_HOLD_LSB, 0
# =============================================================================
# Register    : I2C_IC_TX_ABRT_SOURCE
# Description : I2C Transmit Abort Source Register
#
#               This register has 32 bits that indicate the source of the
#               TX_ABRT bit. Except for Bit 9, this register is cleared
#               whenever the IC_CLR_TX_ABRT register or the IC_CLR_INTR
#               register is read. To clear Bit 9, the source of the
#               ABRT_SBYTE_NORSTRT must be fixed first; RESTART must be enabled
#               (IC_CON[5]=1), the SPECIAL bit must be cleared (IC_TAR[11]), or
#               the GC_OR_START bit must be cleared (IC_TAR[10]).
#
#               Once the source of the ABRT_SBYTE_NORSTRT is fixed, then this
#               bit can be cleared in the same manner as other bits in this
