konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/i2c.inc
#               register. If the source of the ABRT_SBYTE_NORSTRT is not fixed
#               before attempting to clear this bit, Bit 9 clears for one cycle
#               and is then re-asserted.
.equ	I2C_IC_TX_ABRT_SOURCE_OFFSET, 0x00000080
.equ	I2C_IC_TX_ABRT_SOURCE_BITS, 0xff81ffff
.equ	I2C_IC_TX_ABRT_SOURCE_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT
# Description : This field indicates the number of Tx FIFO Data Commands which
#               are flushed due to TX_ABRT interrupt. It is cleared whenever
#               I2C is disabled.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter
.equ	I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_RESET, 0x000
.equ	I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_BITS, 0xff800000
.equ	I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_MSB, 31
.equ	I2C_IC_TX_ABRT_SOURCE_TX_FLUSH_CNT_LSB, 23
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT
# Description : This is a master-mode-only bit. Master has detected the
#               transfer abort (IC_ENABLE[1])
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter
#               0x0 -> Transfer abort detected by master- scenario not present
#               0x1 -> Transfer abort detected by master
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_BITS, 0x00010000
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_MSB, 16
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_LSB, 16
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_VALUE_ABRT_USER_ABRT_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_USER_ABRT_VALUE_ABRT_USER_ABRT_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX
# Description : 1: When the processor side responds to a slave mode request for
#               data to be transmitted to a remote master and user writes a 1
#               in CMD (bit 8) of IC_DATA_CMD register.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Slave-Transmitter
#               0x0 -> Slave trying to transmit to remote master in read mode- scenario not present
#               0x1 -> Slave trying to transmit to remote master in read mode
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_BITS, 0x00008000
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_MSB, 15
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_LSB, 15
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_VALUE_ABRT_SLVRD_INTX_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVRD_INTX_VALUE_ABRT_SLVRD_INTX_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST
# Description : This field indicates that a Slave has lost the bus while
#               transmitting data to a remote master. IC_TX_ABRT_SOURCE[12] is
#               set at the same time. Note:  Even though the slave never 'owns'
#               the bus, something could go wrong on the bus. This is a fail
#               safe check. For instance, during a data transmission at the
#               low-to-high transition of SCL, if what is on the data bus is
#               not what is supposed to be transmitted, then DW_apb_i2c no
#               longer own the bus.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Slave-Transmitter
#               0x0 -> Slave lost arbitration to remote master- scenario not present
#               0x1 -> Slave lost arbitration to remote master
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_BITS, 0x00004000
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_MSB, 14
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_LSB, 14
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_VALUE_ABRT_SLV_ARBLOST_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLV_ARBLOST_VALUE_ABRT_SLV_ARBLOST_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO
# Description : This field specifies that the Slave has received a read command
#               and some data exists in the TX FIFO, so the slave issues a
#               TX_ABRT interrupt to flush old data in TX FIFO.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Slave-Transmitter
#               0x0 -> Slave flushes existing data in TX-FIFO upon getting read command- scenario not present
#               0x1 -> Slave flushes existing data in TX-FIFO upon getting read command
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_BITS, 0x00002000
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_MSB, 13
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_LSB, 13
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_VALUE_ABRT_SLVFLUSH_TXFIFO_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SLVFLUSH_TXFIFO_VALUE_ABRT_SLVFLUSH_TXFIFO_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ARB_LOST
# Description : This field specifies that the Master has lost arbitration, or
#               if IC_TX_ABRT_SOURCE[14] is also set, then the slave
#               transmitter has lost arbitration.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Slave-Transmitter
#               0x0 -> Master or Slave-Transmitter lost arbitration- scenario not present
#               0x1 -> Master or Slave-Transmitter lost arbitration
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_BITS, 0x00001000
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_MSB, 12
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_LSB, 12
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_VALUE_ABRT_LOST_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ARB_LOST_VALUE_ABRT_LOST_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS
# Description : This field indicates that the User tries to initiate a Master
#               operation with the Master mode disabled.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver
#               0x0 -> User initiating master operation when MASTER disabled- scenario not present
#               0x1 -> User initiating master operation when MASTER disabled
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_BITS, 0x00000800
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_MSB, 11
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_LSB, 11
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_VALUE_ABRT_MASTER_DIS_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_MASTER_DIS_VALUE_ABRT_MASTER_DIS_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT
# Description : This field indicates that the restart is disabled
#               (IC_RESTART_EN bit (IC_CON[5]) =0) and the master sends a read
#               command in 10-bit addressing mode.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Receiver
#               0x0 -> Master not trying to read in 10Bit addressing mode when RESTART disabled
#               0x1 -> Master trying to read in 10Bit addressing mode when RESTART disabled
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_BITS, 0x00000400
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_MSB, 10
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_LSB, 10
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_VALUE_ABRT_10B_RD_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10B_RD_NORSTRT_VALUE_ABRT_10B_RD_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT
# Description : To clear Bit 9, the source of the ABRT_SBYTE_NORSTRT must be
#               fixed first; restart must be enabled (IC_CON[5]=1), the SPECIAL
#               bit must be cleared (IC_TAR[11]), or the GC_OR_START bit must
#               be cleared (IC_TAR[10]). Once the source of the
#               ABRT_SBYTE_NORSTRT is fixed, then this bit can be cleared in
#               the same manner as other bits in this register. If the source
#               of the ABRT_SBYTE_NORSTRT is not fixed before attempting to
#               clear this bit, bit 9 clears for one cycle and then gets
#               reasserted. When this field is set to 1, the restart is
#               disabled (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is
#               trying to send a START Byte.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master
#               0x0 -> User trying to send START byte when RESTART disabled- scenario not present
#               0x1 -> User trying to send START byte when RESTART disabled
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_BITS, 0x00000200
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_MSB, 9
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_LSB, 9
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_VALUE_ABRT_SBYTE_NORSTRT_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_NORSTRT_VALUE_ABRT_SBYTE_NORSTRT_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT
# Description : This field indicates that the restart is disabled
#               (IC_RESTART_EN bit (IC_CON[5]) =0) and the user is trying to
#               use the master to transfer data in High Speed mode.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver
#               0x0 -> User trying to switch Master to HS mode when RESTART disabled- scenario not present
#               0x1 -> User trying to switch Master to HS mode when RESTART disabled
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_BITS, 0x00000100
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_MSB, 8
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_LSB, 8
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_VALUE_ABRT_HS_NORSTRT_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_NORSTRT_VALUE_ABRT_HS_NORSTRT_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET
# Description : This field indicates that the Master has sent a START Byte and
#               the START Byte was acknowledged (wrong behavior).
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master
#               0x0 -> ACK detected for START byte- scenario not present
#               0x1 -> ACK detected for START byte
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_BITS, 0x00000080
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_MSB, 7
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_LSB, 7
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_VALUE_ABRT_SBYTE_ACKDET_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_SBYTE_ACKDET_VALUE_ABRT_SBYTE_ACKDET_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET
# Description : This field indicates that the Master is in High Speed mode and
#               the High Speed Master code was acknowledged (wrong behavior).
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master
#               0x0 -> HS Master code ACKed in HS Mode- scenario not present
#               0x1 -> HS Master code ACKed in HS Mode
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_BITS, 0x00000040
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_MSB, 6
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_LSB, 6
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_VALUE_ABRT_HS_ACK_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_HS_ACKDET_VALUE_ABRT_HS_ACK_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ
# Description : This field indicates that DW_apb_i2c in the master mode has
#               sent a General Call but the user programmed the byte following
#               the General Call to be a read from the bus (IC_DATA_CMD[9] is
#               set to 1).
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter
#               0x0 -> GCALL is followed by read from bus-scenario not present
#               0x1 -> GCALL is followed by read from bus
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_BITS, 0x00000020
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_MSB, 5
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_LSB, 5
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_VALUE_ABRT_GCALL_READ_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_READ_VALUE_ABRT_GCALL_READ_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK
# Description : This field indicates that DW_apb_i2c in master mode has sent a
#               General Call and no slave on the bus acknowledged the General
#               Call.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter
#               0x0 -> GCALL not ACKed by any slave-scenario not present
#               0x1 -> GCALL not ACKed by any slave
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_BITS, 0x00000010
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_MSB, 4
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_LSB, 4
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_VALUE_ABRT_GCALL_NOACK_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_GCALL_NOACK_VALUE_ABRT_GCALL_NOACK_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK
# Description : This field indicates the master-mode only bit. When the master
#               receives an acknowledgement for the address, but when it sends
#               data byte(s) following the address, it did not receive an
#               acknowledge from the remote slave(s).
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter
#               0x0 -> Transmitted data non-ACKed by addressed slave-scenario not present
#               0x1 -> Transmitted data not ACKed by addressed slave
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_BITS, 0x00000008
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_MSB, 3
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_LSB, 3
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_VALUE_ABRT_TXDATA_NOACK_VOID, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_TXDATA_NOACK_VALUE_ABRT_TXDATA_NOACK_GENERATED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK
# Description : This field indicates that the Master is in 10-bit address mode
#               and that the second address byte of the 10-bit address was not
#               acknowledged by any slave.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver
#               0x0 -> This abort is not generated
#               0x1 -> Byte 2 of 10Bit Address not ACKed by any slave
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_BITS, 0x00000004
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_MSB, 2
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_LSB, 2
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_VALUE_INACTIVE, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR2_NOACK_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK
# Description : This field indicates that the Master is in 10-bit address mode
#               and the first 10-bit address byte was not acknowledged by any
#               slave.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver
#               0x0 -> This abort is not generated
#               0x1 -> Byte 1 of 10Bit Address not ACKed by any slave
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_BITS, 0x00000002
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_MSB, 1
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_LSB, 1
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_VALUE_INACTIVE, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_10ADDR1_NOACK_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK
# Description : This field indicates that the Master is in 7-bit addressing
#               mode and the address sent was not acknowledged by any slave.
#
#               Reset value: 0x0
#
#               Role of DW_apb_i2c:  Master-Transmitter or Master-Receiver
#               0x0 -> This abort is not generated
#               0x1 -> This abort is generated because of NOACK for 7-bit address
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_RESET, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_BITS, 0x00000001
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_MSB, 0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_LSB, 0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_VALUE_INACTIVE, 0x0
.equ	I2C_IC_TX_ABRT_SOURCE_ABRT_7B_ADDR_NOACK_VALUE_ACTIVE, 0x1
# =============================================================================
# Register    : I2C_IC_SLV_DATA_NACK_ONLY
# Description : Generate Slave Data NACK Register
#
#               The register is used to generate a NACK for the data part of a
#               transfer when DW_apb_i2c is acting as a slave-receiver. This
#               register only exists when the IC_SLV_DATA_NACK_ONLY parameter
#               is set to 1. When this parameter disabled, this register does
#               not exist and writing to the register's address has no effect.
#
#               A write can occur on this register if both of the following
#               conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0)
#               - Slave part is inactive (IC_STATUS[6] = 0) Note: The
#               IC_STATUS[6] is a register read-back location for the internal
#               slv_activity signal; the user should poll this before writing
#               the ic_slv_data_nack_only bit.
.equ	I2C_IC_SLV_DATA_NACK_ONLY_OFFSET, 0x00000084
.equ	I2C_IC_SLV_DATA_NACK_ONLY_BITS, 0x00000001
.equ	I2C_IC_SLV_DATA_NACK_ONLY_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SLV_DATA_NACK_ONLY_NACK
# Description : Generate NACK. This NACK generation only occurs when DW_apb_i2c
#               is a slave-receiver. If this register is set to a value of 1,
#               it can only generate a NACK after a data byte is received;
#               hence, the data transfer is aborted and the data received is
#               not pushed to the receive buffer.
#
#               When the register is set to a value of 0, it generates
#               NACK/ACK, depending on normal criteria. - 1: generate NACK
#               after data byte received - 0: generate NACK/ACK normally Reset
#               value: 0x0
#               0x0 -> Slave receiver generates NACK normally
#               0x1 -> Slave receiver generates NACK upon data reception only
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_RESET, 0x0
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_BITS, 0x00000001
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_MSB, 0
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_LSB, 0
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_VALUE_DISABLED, 0x0
.equ	I2C_IC_SLV_DATA_NACK_ONLY_NACK_VALUE_ENABLED, 0x1
# =============================================================================
# Register    : I2C_IC_DMA_CR
# Description : DMA Control Register
#
#               The register is used to enable the DMA Controller interface
#               operation. There is a separate bit for transmit and receive.
#               This can be programmed regardless of the state of IC_ENABLE.
.equ	I2C_IC_DMA_CR_OFFSET, 0x00000088
.equ	I2C_IC_DMA_CR_BITS, 0x00000003
.equ	I2C_IC_DMA_CR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DMA_CR_TDMAE
# Description : Transmit DMA Enable. This bit enables/disables the transmit
#               FIFO DMA channel. Reset value: 0x0
#               0x0 -> transmit FIFO DMA channel disabled
#               0x1 -> Transmit FIFO DMA channel enabled
.equ	I2C_IC_DMA_CR_TDMAE_RESET, 0x0
.equ	I2C_IC_DMA_CR_TDMAE_BITS, 0x00000002
.equ	I2C_IC_DMA_CR_TDMAE_MSB, 1
.equ	I2C_IC_DMA_CR_TDMAE_LSB, 1
.equ	I2C_IC_DMA_CR_TDMAE_VALUE_DISABLED, 0x0
.equ	I2C_IC_DMA_CR_TDMAE_VALUE_ENABLED, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DMA_CR_RDMAE
# Description : Receive DMA Enable. This bit enables/disables the receive FIFO
#               DMA channel. Reset value: 0x0
#               0x0 -> Receive FIFO DMA channel disabled
#               0x1 -> Receive FIFO DMA channel enabled
.equ	I2C_IC_DMA_CR_RDMAE_RESET, 0x0
.equ	I2C_IC_DMA_CR_RDMAE_BITS, 0x00000001
.equ	I2C_IC_DMA_CR_RDMAE_MSB, 0
.equ	I2C_IC_DMA_CR_RDMAE_LSB, 0
.equ	I2C_IC_DMA_CR_RDMAE_VALUE_DISABLED, 0x0
.equ	I2C_IC_DMA_CR_RDMAE_VALUE_ENABLED, 0x1
# =============================================================================
# Register    : I2C_IC_DMA_TDLR
# Description : DMA Transmit Data Level Register
.equ	I2C_IC_DMA_TDLR_OFFSET, 0x0000008c
.equ	I2C_IC_DMA_TDLR_BITS, 0x0000000f
.equ	I2C_IC_DMA_TDLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DMA_TDLR_DMATDL
# Description : Transmit Data Level. This bit field controls the level at which
#               a DMA request is made by the transmit logic. It is equal to the
#               watermark level; that is, the dma_tx_req signal is generated
#               when the number of valid data entries in the transmit FIFO is
#               equal to or below this field value, and TDMAE = 1.
#
#               Reset value: 0x0
.equ	I2C_IC_DMA_TDLR_DMATDL_RESET, 0x0
.equ	I2C_IC_DMA_TDLR_DMATDL_BITS, 0x0000000f
.equ	I2C_IC_DMA_TDLR_DMATDL_MSB, 3
.equ	I2C_IC_DMA_TDLR_DMATDL_LSB, 0
# =============================================================================
# Register    : I2C_IC_DMA_RDLR
# Description : I2C Receive Data Level Register
.equ	I2C_IC_DMA_RDLR_OFFSET, 0x00000090
.equ	I2C_IC_DMA_RDLR_BITS, 0x0000000f
.equ	I2C_IC_DMA_RDLR_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_DMA_RDLR_DMARDL
# Description : Receive Data Level. This bit field controls the level at which
#               a DMA request is made by the receive logic. The watermark level
#               = DMARDL+1; that is, dma_rx_req is generated when the number of
#               valid data entries in the receive FIFO is equal to or more than
#               this field value + 1, and RDMAE =1. For instance, when DMARDL
#               is 0, then dma_rx_req is asserted when 1 or more data entries
#               are present in the receive FIFO.
#
#               Reset value: 0x0
.equ	I2C_IC_DMA_RDLR_DMARDL_RESET, 0x0
