konstantin-dzreev/bare-metal-rp2350-riscv/include/hardware/regs/i2c.inc
.equ	I2C_IC_DMA_RDLR_DMARDL_BITS, 0x0000000f
.equ	I2C_IC_DMA_RDLR_DMARDL_MSB, 3
.equ	I2C_IC_DMA_RDLR_DMARDL_LSB, 0
# =============================================================================
# Register    : I2C_IC_SDA_SETUP
# Description : I2C SDA Setup Register
#
#               This register controls the amount of time delay (in terms of
#               number of ic_clk clock periods) introduced in the rising edge
#               of SCL - relative to SDA changing - when DW_apb_i2c services a
#               read request in a slave-transmitter operation. The relevant I2C
#               requirement is tSU:DAT (note 4) as detailed in the I2C Bus
#               Specification. This register must be programmed with a value
#               equal to or greater than 2.
#
#               Writes to this register succeed only when IC_ENABLE[0] = 0.
#
#               Note: The length of setup time is calculated using
#               [(IC_SDA_SETUP - 1) * (ic_clk_period)], so if the user requires
#               10 ic_clk periods of setup time, they should program a value of
#               11. The IC_SDA_SETUP register is only used by the DW_apb_i2c
#               when operating as a slave transmitter.
.equ	I2C_IC_SDA_SETUP_OFFSET, 0x00000094
.equ	I2C_IC_SDA_SETUP_BITS, 0x000000ff
.equ	I2C_IC_SDA_SETUP_RESET, 0x00000064
# -----------------------------------------------------------------------------
# Field       : I2C_IC_SDA_SETUP_SDA_SETUP
# Description : SDA Setup. It is recommended that if the required delay is
#               1000ns, then for an ic_clk frequency of 10 MHz, IC_SDA_SETUP
#               should be programmed to a value of 11. IC_SDA_SETUP must be
#               programmed with a minimum value of 2.
.equ	I2C_IC_SDA_SETUP_SDA_SETUP_RESET, 0x64
.equ	I2C_IC_SDA_SETUP_SDA_SETUP_BITS, 0x000000ff
.equ	I2C_IC_SDA_SETUP_SDA_SETUP_MSB, 7
.equ	I2C_IC_SDA_SETUP_SDA_SETUP_LSB, 0
# =============================================================================
# Register    : I2C_IC_ACK_GENERAL_CALL
# Description : I2C ACK General Call Register
#
#               The register controls whether DW_apb_i2c responds with a ACK or
#               NACK when it receives an I2C General Call address.
#
#               This register is applicable only when the DW_apb_i2c is in
#               slave mode.
.equ	I2C_IC_ACK_GENERAL_CALL_OFFSET, 0x00000098
.equ	I2C_IC_ACK_GENERAL_CALL_BITS, 0x00000001
.equ	I2C_IC_ACK_GENERAL_CALL_RESET, 0x00000001
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL
# Description : ACK General Call. When set to 1, DW_apb_i2c responds with a ACK
#               (by asserting ic_data_oe) when it receives a General Call.
#               Otherwise, DW_apb_i2c responds with a NACK (by negating
#               ic_data_oe).
#               0x0 -> Generate NACK for a General Call
#               0x1 -> Generate ACK for a General Call
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_RESET, 0x1
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_BITS, 0x00000001
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_MSB, 0
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_LSB, 0
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_VALUE_DISABLED, 0x0
.equ	I2C_IC_ACK_GENERAL_CALL_ACK_GEN_CALL_VALUE_ENABLED, 0x1
# =============================================================================
# Register    : I2C_IC_ENABLE_STATUS
# Description : I2C Enable Status Register
#
#               The register is used to report the DW_apb_i2c hardware status
#               when the IC_ENABLE[0] register is set from 1 to 0; that is,
#               when DW_apb_i2c is disabled.
#
#               If IC_ENABLE[0] has been set to 1, bits 2:1 are forced to 0,
#               and bit 0 is forced to 1.
#
#               If IC_ENABLE[0] has been set to 0, bits 2:1 is only be valid as
#               soon as bit 0 is read as '0'.
#
#               Note: When IC_ENABLE[0] has been set to 0, a delay occurs for
#               bit 0 to be read as 0 because disabling the DW_apb_i2c depends
#               on I2C bus activities.
.equ	I2C_IC_ENABLE_STATUS_OFFSET, 0x0000009c
.equ	I2C_IC_ENABLE_STATUS_BITS, 0x00000007
.equ	I2C_IC_ENABLE_STATUS_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST
# Description : Slave Received Data Lost. This bit indicates if a Slave-
#               Receiver operation has been aborted with at least one data byte
#               received from an I2C transfer due to the setting bit 0 of
#               IC_ENABLE from 1 to 0. When read as 1, DW_apb_i2c is deemed to
#               have been actively engaged in an aborted I2C transfer (with
#               matching address) and the data phase of the I2C transfer has
#               been entered, even though a data byte has been responded with a
#               NACK.
#
#               Note:  If the remote I2C master terminates the transfer with a
#               STOP condition before the DW_apb_i2c has a chance to NACK a
#               transfer, and IC_ENABLE[0] has been set to 0, then this bit is
#               also set to 1.
#
#               When read as 0, DW_apb_i2c is deemed to have been disabled
#               without being actively involved in the data phase of a Slave-
#               Receiver transfer.
#
#               Note:  The CPU can safely read this bit when IC_EN (bit 0) is
#               read as 0.
#
#               Reset value: 0x0
#               0x0 -> Slave RX Data is not lost
#               0x1 -> Slave RX Data is lost
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_RESET, 0x0
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_BITS, 0x00000004
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_MSB, 2
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_LSB, 2
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_VALUE_INACTIVE, 0x0
.equ	I2C_IC_ENABLE_STATUS_SLV_RX_DATA_LOST_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY
# Description : Slave Disabled While Busy (Transmit, Receive). This bit
#               indicates if a potential or active Slave operation has been
#               aborted due to the setting bit 0 of the IC_ENABLE register from
#               1 to 0. This bit is set when the CPU writes a 0 to the
#               IC_ENABLE register while:
#
#               (a) DW_apb_i2c is receiving the address byte of the Slave-
#               Transmitter operation from a remote master;
#
#               OR,
#
#               (b) address and data bytes of the Slave-Receiver operation from
#               a remote master.
#
#               When read as 1, DW_apb_i2c is deemed to have forced a NACK
#               during any part of an I2C transfer, irrespective of whether the
#               I2C address matches the slave address set in DW_apb_i2c (IC_SAR
#               register) OR if the transfer is completed before IC_ENABLE is
#               set to 0 but has not taken effect.
#
#               Note:  If the remote I2C master terminates the transfer with a
#               STOP condition before the DW_apb_i2c has a chance to NACK a
#               transfer, and IC_ENABLE[0] has been set to 0, then this bit
#               will also be set to 1.
#
#               When read as 0, DW_apb_i2c is deemed to have been disabled when
#               there is master activity, or when the I2C bus is idle.
#
#               Note:  The CPU can safely read this bit when IC_EN (bit 0) is
#               read as 0.
#
#               Reset value: 0x0
#               0x0 -> Slave is disabled when it is idle
#               0x1 -> Slave is disabled when it is active
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_RESET, 0x0
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_BITS, 0x00000002
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_MSB, 1
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_LSB, 1
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_VALUE_INACTIVE, 0x0
.equ	I2C_IC_ENABLE_STATUS_SLV_DISABLED_WHILE_BUSY_VALUE_ACTIVE, 0x1
# -----------------------------------------------------------------------------
# Field       : I2C_IC_ENABLE_STATUS_IC_EN
# Description : ic_en Status. This bit always reflects the value driven on the
#               output port ic_en. - When read as 1, DW_apb_i2c is deemed to be
#               in an enabled state. - When read as 0, DW_apb_i2c is deemed
#               completely inactive. Note:  The CPU can safely read this bit
#               anytime. When this bit is read as 0, the CPU can safely read
#               SLV_RX_DATA_LOST (bit 2) and SLV_DISABLED_WHILE_BUSY (bit 1).
#
#               Reset value: 0x0
#               0x0 -> I2C disabled
#               0x1 -> I2C enabled
.equ	I2C_IC_ENABLE_STATUS_IC_EN_RESET, 0x0
.equ	I2C_IC_ENABLE_STATUS_IC_EN_BITS, 0x00000001
.equ	I2C_IC_ENABLE_STATUS_IC_EN_MSB, 0
.equ	I2C_IC_ENABLE_STATUS_IC_EN_LSB, 0
.equ	I2C_IC_ENABLE_STATUS_IC_EN_VALUE_DISABLED, 0x0
.equ	I2C_IC_ENABLE_STATUS_IC_EN_VALUE_ENABLED, 0x1
# =============================================================================
# Register    : I2C_IC_FS_SPKLEN
# Description : I2C SS, FS or FM+ spike suppression limit
#
#               This register is used to store the duration, measured in ic_clk
#               cycles, of the longest spike that is filtered out by the spike
#               suppression logic when the component is operating in SS, FS or
#               FM+ modes. The relevant I2C requirement is tSP (table 4) as
#               detailed in the I2C Bus Specification. This register must be
#               programmed with a minimum value of 1.
.equ	I2C_IC_FS_SPKLEN_OFFSET, 0x000000a0
.equ	I2C_IC_FS_SPKLEN_BITS, 0x000000ff
.equ	I2C_IC_FS_SPKLEN_RESET, 0x00000007
# -----------------------------------------------------------------------------
# Field       : I2C_IC_FS_SPKLEN_IC_FS_SPKLEN
# Description : This register must be set before any I2C bus transaction can
#               take place to ensure stable operation. This register sets the
#               duration, measured in ic_clk cycles, of the longest spike in
#               the SCL or SDA lines that will be filtered out by the spike
#               suppression logic. This register can be written only when the
#               I2C interface is disabled which corresponds to the IC_ENABLE[0]
#               register being set to 0. Writes at other times have no effect.
#               The minimum valid value is 1; hardware prevents values less
#               than this being written, and if attempted results in 1 being
#               set. or more information, refer to 'Spike Suppression'.
.equ	I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_RESET, 0x07
.equ	I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_BITS, 0x000000ff
.equ	I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_MSB, 7
.equ	I2C_IC_FS_SPKLEN_IC_FS_SPKLEN_LSB, 0
# =============================================================================
# Register    : I2C_IC_CLR_RESTART_DET
# Description : Clear RESTART_DET Interrupt Register
.equ	I2C_IC_CLR_RESTART_DET_OFFSET, 0x000000a8
.equ	I2C_IC_CLR_RESTART_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_RESTART_DET_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET
# Description : Read this register to clear the RESTART_DET interrupt (bit 12)
#               of IC_RAW_INTR_STAT register.
#
#               Reset value: 0x0
.equ	I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_RESET, 0x0
.equ	I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_BITS, 0x00000001
.equ	I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_MSB, 0
.equ	I2C_IC_CLR_RESTART_DET_CLR_RESTART_DET_LSB, 0
# =============================================================================
# Register    : I2C_IC_COMP_PARAM_1
# Description : Component Parameter Register 1
#
#               Note This register is not implemented and therefore reads as 0.
#               If it was implemented it would be a constant read-only register
#               that contains encoded information about the component's
#               parameter settings. Fields shown below are the settings for
#               those parameters
.equ	I2C_IC_COMP_PARAM_1_OFFSET, 0x000000f4
.equ	I2C_IC_COMP_PARAM_1_BITS, 0x00ffffff
.equ	I2C_IC_COMP_PARAM_1_RESET, 0x00000000
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH
# Description : TX Buffer Depth = 16
.equ	I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_RESET, 0x00
.equ	I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_BITS, 0x00ff0000
.equ	I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_MSB, 23
.equ	I2C_IC_COMP_PARAM_1_TX_BUFFER_DEPTH_LSB, 16
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH
# Description : RX Buffer Depth = 16
.equ	I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_RESET, 0x00
.equ	I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_BITS, 0x0000ff00
.equ	I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_MSB, 15
.equ	I2C_IC_COMP_PARAM_1_RX_BUFFER_DEPTH_LSB, 8
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS
# Description : Encoded parameters not visible
.equ	I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_BITS, 0x00000080
.equ	I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_MSB, 7
.equ	I2C_IC_COMP_PARAM_1_ADD_ENCODED_PARAMS_LSB, 7
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_HAS_DMA
# Description : DMA handshaking signals are enabled
.equ	I2C_IC_COMP_PARAM_1_HAS_DMA_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_HAS_DMA_BITS, 0x00000040
.equ	I2C_IC_COMP_PARAM_1_HAS_DMA_MSB, 6
.equ	I2C_IC_COMP_PARAM_1_HAS_DMA_LSB, 6
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_INTR_IO
# Description : COMBINED Interrupt outputs
.equ	I2C_IC_COMP_PARAM_1_INTR_IO_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_INTR_IO_BITS, 0x00000020
.equ	I2C_IC_COMP_PARAM_1_INTR_IO_MSB, 5
.equ	I2C_IC_COMP_PARAM_1_INTR_IO_LSB, 5
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES
# Description : Programmable count values for each mode.
.equ	I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_BITS, 0x00000010
.equ	I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_MSB, 4
.equ	I2C_IC_COMP_PARAM_1_HC_COUNT_VALUES_LSB, 4
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE
# Description : MAX SPEED MODE = FAST MODE
.equ	I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_BITS, 0x0000000c
.equ	I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_MSB, 3
.equ	I2C_IC_COMP_PARAM_1_MAX_SPEED_MODE_LSB, 2
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH
# Description : APB data bus width is 32 bits
.equ	I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_RESET, 0x0
.equ	I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_BITS, 0x00000003
.equ	I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_MSB, 1
.equ	I2C_IC_COMP_PARAM_1_APB_DATA_WIDTH_LSB, 0
# =============================================================================
# Register    : I2C_IC_COMP_VERSION
# Description : I2C Component Version Register
.equ	I2C_IC_COMP_VERSION_OFFSET, 0x000000f8
.equ	I2C_IC_COMP_VERSION_BITS, 0xffffffff
.equ	I2C_IC_COMP_VERSION_RESET, 0x3230312a
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_VERSION_IC_COMP_VERSION
.equ	I2C_IC_COMP_VERSION_IC_COMP_VERSION_RESET, 0x3230312a
.equ	I2C_IC_COMP_VERSION_IC_COMP_VERSION_BITS, 0xffffffff
.equ	I2C_IC_COMP_VERSION_IC_COMP_VERSION_MSB, 31
.equ	I2C_IC_COMP_VERSION_IC_COMP_VERSION_LSB, 0
# =============================================================================
# Register    : I2C_IC_COMP_TYPE
# Description : I2C Component Type Register
.equ	I2C_IC_COMP_TYPE_OFFSET, 0x000000fc
.equ	I2C_IC_COMP_TYPE_BITS, 0xffffffff
.equ	I2C_IC_COMP_TYPE_RESET, 0x44570140
# -----------------------------------------------------------------------------
# Field       : I2C_IC_COMP_TYPE_IC_COMP_TYPE
# Description : Designware Component Type number = 0x44_57_01_40. This assigned
#               unique hex value is constant and is derived from the two ASCII
#               letters 'DW' followed by a 16-bit unsigned number.
.equ	I2C_IC_COMP_TYPE_IC_COMP_TYPE_RESET, 0x44570140
.equ	I2C_IC_COMP_TYPE_IC_COMP_TYPE_BITS, 0xffffffff
.equ	I2C_IC_COMP_TYPE_IC_COMP_TYPE_MSB, 31
.equ	I2C_IC_COMP_TYPE_IC_COMP_TYPE_LSB, 0
# =============================================================================
.endif # _HARDWARE_REGS_I2C_H
